app/controllers/articles_controller.rb

  def index                              # 記事一覧画面
    @article = Article.new
    #　検索フォーム
    @articles = Article.search(params[:search])
---
SELECT "articles".* FROM "articles"